#### 1. pandas数据分析处理库

In [3]:
import pandas as pd 
df = pd.read_csv('titanic_train.csv')

In [7]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [23]:
# 前几条数据 df.head(1)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [66]:
data = {
    'country': ['China', "Usa"],
    'population': ['12', '5']
}


cdf = pd.DataFrame(data=data)
cdf.index = cdf.country

In [67]:
cdf

        country population
country
China     China         12
Usa         Usa          5

In [79]:
df['Age'].tail().values.tolist()

[27.0, 19.0, nan, 26.0, 32.0]

```
df = df.set_index('Name')
# 设置索引

```

In [87]:
df = df.set_index('Name')

In [91]:
age = df.Age
age['Braund, Mr. Owen Harris']

22.0

In [92]:
age = age +10
age['Braund, Mr. Owen Harris']

32.0

In [103]:
age.mean().round(2)

39.7

In [107]:
# 统计有数字的列，统计分析
df.describe()

PassengerId    478.044230
Survived       111.733804
Pclass         113.268089
Age            115.596327
SibSp          112.703219
Parch          112.273456
Fare           192.323930
dtype: float64